'''
1 Вычислить число π c заданной точностью d

*Пример:*

- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

'''
#Формула выслениә пи((2**0.5) + (3 ** 0.5))

def find_pi():
    d = list(input("Enter the value of the number d: "))
    d2 = ''
    d3 = []
    for i in range(len(d)):
        d3.append(d[i].replace('.' , '0'))
    pi = round(((2**0.5) + (3 ** 0.5)), (len(d) - 2))
    print(f' при $d =  {d2.join(d)}  π =  {pi}')


find_pi()

#Честно скажу задание вообще не понял делал по примеру)